test001.c: 函数 `test000' :
test001.c:16: エラー: 3 項演算子の第 2 式と第 3 式の型が不正です.
test001.c: 函数 `test001' :
test001.c:23: エラー: 3 項演算子の第 2 式と第 3 式の型が不正です.
test001.c: 函数 `test002' :
test001.c:30: エラー: 3 項演算子の第 2 式と第 3 式の型が不正です.
test001.c: 函数 `test003' :
test001.c:39: エラー: 3 項演算子の第 2 式と第 3 式の型が不正です.
test001.c: 函数 `test004' :
test001.c:44: エラー: 3 項演算子の第 2 式と第 3 式の型が不正です.
test001.c: 函数 `test005' :
test001.c:49: エラー: 3 項演算子の第 2 式と第 3 式の型が不正です.
test001.c: 函数 `test006' :
test001.c:54: エラー: 3 項演算子の第 2 式と第 3 式の型が不正です.
test001.c: 函数 `test007' :
test001.c:59: エラー: 3 項演算子の第 2 式と第 3 式の型が不正です.
test001.c: 函数 `test008' :
test001.c:67: エラー: 式文の式の型が不完全型です.
