test006.c:10: エラー: `a' は宣言されていません.
test006.c:10: エラー: `test000' が void として宣言されています.
test006.c:10: エラー: `b' は宣言されていません.
test006.c:10: エラー: `c' は宣言されていません.
test006.c:10: エラー: `test000' の初期化指定子が要素数を超えて指定されています.
test006.c:11: エラー: `int' で構文エラーです.
test006.c:13: エラー: `{' で構文エラーです.
test006.c:16: エラー: `test001' は宣言されていません.
test006.c:19: エラー: `{' で構文エラーです.
test006.c:22: エラー: `test002' は宣言されていません.
test006.c:27: エラー: `A' は宣言されていません.
test006.c:29: エラー: `test003' が void として宣言されています.
test006.c:30: エラー: `int' で構文エラーです.
test006.c:38: エラー: ファイルスコープで記憶クラスが auto, register の宣言です.
test006.c:39: エラー: `{' で構文エラーです.
test006.c:42: エラー: `test005' は宣言されていません.
test006.c:45: エラー: `{' で構文エラーです.
