test006.c:11: エラー: 空の宣言です.
test006.c: 函数 `test001' :
test006.c:18: エラー: `d' は宣言されていますが、パラメータとして指定されていません.
test006.c: 函数 `test002' :
test006.c:24: エラー: `c' はパラメータとして指定されていますが、宣言されていません.
test006.c:31: エラー: 1 番目のパラメータが省略されています.
test006.c: 函数 `test004' :
test006.c:35: エラー: `a' の記憶クラスに register 以外が指定されています.
test006.c:36: エラー: `b' の記憶クラスに register 以外が指定されています.
test006.c:37: エラー: `c' の記憶クラスに register 以外が指定されています.
test006.c:38: エラー: `d' の記憶クラスに register 以外が指定されています.
test006.c:44: エラー: `b' に初期化指定子が指定されています.
