test001.c: 函数 `test00' :
test001.c:10: エラー: 函数ではない `a' を呼び出しました.
test001.c:11: エラー: 函数ではない `"string"' を呼び出しました.
test001.c:12: エラー: 函数ではない `L"wide string"' を呼び出しました.
test001.c: 函数 `test01' :
test001.c:19: エラー: `member' は宣言されていません.
test001.c:19: エラー: 構造体でないものに対してメンバーが参照されています.
test001.c:20: エラー: 構造体でないものに対してメンバーが参照されています.
test001.c:21: エラー: 構造体でないものに対してメンバーが参照されています.
test001.c: 函数 `test02' :
test001.c:28: エラー: `member' は宣言されていません.
test001.c:28: エラー: 構造体でないものに対してメンバーが参照されています.
test001.c:29: エラー: 構造体でないものに対してメンバーが参照されています.
test001.c:30: エラー: 構造体でないものに対してメンバーが参照されています.
test001.c: 函数 `test03' :
test001.c:37: エラー: `++' 演算子が型 `int[10] 'に適用されています.
test001.c:38: エラー: `++' 演算子が型 `const char[7] 'に適用されています.
test001.c:39: エラー: `++' 演算子が型 `const wchar_t[12] 'に適用されています.
test001.c: 函数 `test04' :
test001.c:46: エラー: `--' 演算子が型 `int[10] 'に適用されています.
test001.c:47: エラー: `--' 演算子が型 `const char[7] 'に適用されています.
test001.c:48: エラー: `--' 演算子が型 `const wchar_t[12] 'に適用されています.
test001.c: 函数 `test05' :
test001.c:55: エラー: `++' 演算子が型 `int[10] 'に適用されています.
test001.c:56: エラー: `++' 演算子が型 `const char[7] 'に適用されています.
test001.c:57: エラー: `++' 演算子が型 `const wchar_t[12] 'に適用されています.
test001.c: 函数 `test06' :
test001.c:64: エラー: `--' 演算子が型 `int[10] 'に適用されています.
test001.c:65: エラー: `--' 演算子が型 `const char[7] 'に適用されています.
test001.c:66: エラー: `--' 演算子が型 `const wchar_t[12] 'に適用されています.
test001.c: 函数 `test07' :
test001.c:73: エラー: 単項の `+' が型 `int *' に適用されています.
test001.c:74: エラー: 単項の `+' が型 `const char *' に適用されています.
test001.c:75: エラー: 単項の `+' が型 `const wchar_t *' に適用されています.
test001.c: 函数 `test08' :
test001.c:82: エラー: 単項の `-' が型 `int *' に適用されています.
test001.c:83: エラー: 単項の `-' が型 `const char *' に適用されています.
test001.c:84: エラー: 単項の `-' が型 `const wchar_t *' に適用されています.
test001.c: 函数 `test09' :
test001.c:91: エラー: 単項の `~' が型 `int *' に適用されています.
test001.c:92: エラー: 単項の `~' が型 `const char *' に適用されています.
test001.c:93: エラー: 単項の `~' が型 `const wchar_t *' に適用されています.
test001.c: 函数 `test10' :
test001.c:100: エラー: 二項演算子 `*' が型 `int *' と型 `const int' に適用されました.
test001.c:101: エラー: 二項演算子 `*' が型 `const char *' と型 `const int' に適用されました.
test001.c:102: エラー: 二項演算子 `*' が型 `const int' と型 `const wchar_t *' に適用されました.
test001.c: 函数 `test11' :
test001.c:109: エラー: 二項演算子 `/' が型 `int *' と型 `const int' に適用されました.
test001.c:110: エラー: 二項演算子 `/' が型 `const char *' と型 `const int' に適用されました.
test001.c:111: エラー: 二項演算子 `/' が型 `const int' と型 `const wchar_t *' に適用されました.
test001.c: 函数 `test12' :
test001.c:118: エラー: 二項演算子 `%' が型 `int *' と型 `const int' に適用されました.
test001.c:119: エラー: 二項演算子 `%' が型 `const char *' と型 `const int' に適用されました.
test001.c:120: エラー: 二項演算子 `%' が型 `const int' と型 `const wchar_t *' に適用されました.
test001.c: 函数 `test13' :
test001.c:127: エラー: 二項演算子 `-' が型 `const int' と型 `int *' に適用されました.
test001.c:128: エラー: 二項演算子 `-' が型 `int' と型 `const char *' に適用されました.
test001.c:129: エラー: 二項演算子 `-' が型 `int' と型 `const wchar_t *' に適用されました.
test001.c: 函数 `test14' :
test001.c:136: エラー: 二項演算子 `<<' が型 `int *' と型 `const int' に適用されました.
test001.c:137: エラー: 二項演算子 `<<' が型 `int' と型 `const char *' に適用されました.
test001.c:138: エラー: 二項演算子 `<<' が型 `const wchar_t *' と型 `int' に適用されました.
test001.c: 函数 `test15' :
test001.c:145: エラー: 二項演算子 `>>' が型 `int *' と型 `const int' に適用されました.
test001.c:146: エラー: 二項演算子 `>>' が型 `int' と型 `const char *' に適用されました.
test001.c:147: エラー: 二項演算子 `>>' が型 `int' と型 `const wchar_t *' に適用されました.
test001.c: 函数 `test16' :
test001.c:154: エラー: 二項演算子 `&' が型 `int *' と型 `const int' に適用されました.
test001.c:155: エラー: 二項演算子 `&' が型 `int' と型 `const char *' に適用されました.
test001.c:156: エラー: 二項演算子 `&' が型 `const wchar_t *' と型 `int' に適用されました.
test001.c: 函数 `test17' :
test001.c:163: エラー: 二項演算子 `^' が型 `int *' と型 `const int' に適用されました.
test001.c:164: エラー: 二項演算子 `^' が型 `int' と型 `const char *' に適用されました.
test001.c:165: エラー: 二項演算子 `^' が型 `int' と型 `const wchar_t *' に適用されました.
test001.c: 函数 `test18' :
test001.c:172: エラー: 二項演算子 `|' が型 `int *' と型 `const int' に適用されました.
test001.c:173: エラー: 二項演算子 `|' が型 `int' と型 `const char *' に適用されました.
test001.c:174: エラー: 二項演算子 `|' が型 `int' と型 `const wchar_t *' に適用されました.
test001.c: 函数 `test19' :
test001.c:182: エラー: 3 項演算子の第 2 式と第 3 式の型が不正です.
test001.c:183: エラー: 3 項演算子の第 2 式と第 3 式の型が不正です.
test001.c: 函数 `test20' :
test001.c:190: エラー: 代入演算子が型 `int[10]' に適用されています.
test001.c:191: エラー: 代入演算子が型 `int[10]' に適用されています.
test001.c:192: エラー: 代入演算子が型 `int[10]' に適用されています.
test001.c:193: エラー: 代入演算子が型 `const char[8]' に適用されています.
test001.c:194: エラー: 代入演算子が型 `const wchar_t[8]' に適用されています.
