test000.c: 函数 `test00' :
test000.c:8: エラー: 単項の `~' が型 `float' に適用されています.
test000.c:9: エラー: 単項の `~' が型 `double' に適用されています.
test000.c:10: エラー: 単項の `~' が型 `long double' に適用されています.
test000.c: 函数 `test01' :
test000.c:15: エラー: 単項の `+' が型 `int *' に適用されています.
test000.c:16: エラー: 単項の `-' が型 `char *' に適用されています.
test000.c:17: エラー: 単項の `~' が型 `void *' に適用されています.
test000.c:18: エラー: 単項の `+' が型 `int *' に適用されています.
test000.c:19: エラー: 単項の `-' が型 `char *' に適用されています.
test000.c:20: エラー: 単項の `~' が型 `void *' に適用されています.
test000.c: 函数 `test02' :
test000.c:26: エラー: 単項の `+' が型 `struct S' に適用されています.
test000.c:27: エラー: 単項の `-' が型 `struct S' に適用されています.
test000.c:28: エラー: 単項の `~' が型 `struct S' に適用されています.
test000.c:29: エラー: 単項の `!' が型 `struct S' に適用されています.
test000.c:31: エラー: 単項の `+' が型 `union U' に適用されています.
test000.c:32: エラー: 単項の `-' が型 `union U' に適用されています.
test000.c:33: エラー: 単項の `~' が型 `union U' に適用されています.
test000.c:34: エラー: 単項の `!' が型 `union U' に適用されています.
test000.c: 函数 `test03' :
test000.c:40: エラー: 単項の `+' が型 `struct S' に適用されています.
test000.c:40: エラー: 式文の式の型が不完全型です.
test000.c:41: エラー: 単項の `-' が型 `struct S' に適用されています.
test000.c:41: エラー: 式文の式の型が不完全型です.
test000.c:42: エラー: 単項の `~' が型 `struct S' に適用されています.
test000.c:42: エラー: 式文の式の型が不完全型です.
test000.c:43: エラー: 単項の `!' が型 `struct S' に適用されています.
test000.c:45: エラー: 単項の `+' が型 `union U' に適用されています.
test000.c:45: エラー: 式文の式の型が不完全型です.
test000.c:46: エラー: 単項の `-' が型 `union U' に適用されています.
test000.c:46: エラー: 式文の式の型が不完全型です.
test000.c:47: エラー: 単項の `~' が型 `union U' に適用されています.
test000.c:47: エラー: 式文の式の型が不完全型です.
test000.c:48: エラー: 単項の `!' が型 `union U' に適用されています.
test000.c:50: エラー: 単項の `+' が型 `enum E' に適用されています.
test000.c:50: エラー: 式文の式の型が不完全型です.
test000.c:51: エラー: 単項の `-' が型 `enum E' に適用されています.
test000.c:51: エラー: 式文の式の型が不完全型です.
test000.c:52: エラー: 単項の `~' が型 `enum E' に適用されています.
test000.c:52: エラー: 式文の式の型が不完全型です.
test000.c:53: エラー: 単項の `!' が型 `enum E' に適用されています.
