test000.c: 函数 `f' :
test000.c:11: エラー: 二項演算子 `<' が型 `int' と型 `char *' に適用されました.
test000.c:12: エラー: 二項演算子 `>' が型 `int' と型 `char *' に適用されました.
test000.c:13: エラー: 二項演算子 `<=' が型 `int' と型 `char *' に適用されました.
test000.c:14: エラー: 二項演算子 `>=' が型 `int' と型 `char *' に適用されました.
test000.c:15: エラー: 二項演算子 `<' が型 `int' と型 `void *' に適用されました.
test000.c:16: エラー: 二項演算子 `>' が型 `int' と型 `void *' に適用されました.
test000.c:17: エラー: 二項演算子 `<=' が型 `int' と型 `void *' に適用されました.
test000.c:18: エラー: 二項演算子 `>=' が型 `int' と型 `void *' に適用されました.
test000.c:19: エラー: 二項演算子 `<' が型 `char *' と型 `void *' に適用されました.
test000.c:20: エラー: 二項演算子 `>' が型 `char *' と型 `void *' に適用されました.
test000.c:21: エラー: 二項演算子 `<=' が型 `char *' と型 `void *' に適用されました.
test000.c:22: エラー: 二項演算子 `>=' が型 `char *' と型 `void *' に適用されました.
test000.c:23: エラー: 二項演算子 `<' が型 `const int' と型 `char *' に適用されました.
test000.c:24: エラー: 二項演算子 `>' が型 `const int' と型 `char *' に適用されました.
test000.c:25: エラー: 二項演算子 `<=' が型 `const int' と型 `char *' に適用されました.
test000.c:26: エラー: 二項演算子 `>=' が型 `const int' と型 `char *' に適用されました.
test000.c:27: エラー: 二項演算子 `<' が型 `const int' と型 `void *' に適用されました.
test000.c:28: エラー: 二項演算子 `>' が型 `const int' と型 `int *' に適用されました.
test000.c:29: エラー: 二項演算子 `<=' が型 `const int' と型 `double *' に適用されました.
test000.c:30: エラー: 二項演算子 `>=' が型 `const int' と型 `long int *' に適用されました.
