test001.c:6: エラー: `s' が不完全型の `struct S' として宣言されています.
test001.c:6: エラー: `struct S' はここで宣言されています.
test001.c:6: エラー: `s' の初期化指定子が要素数を超えて指定されています.
test001.c:6: エラー: `s' の初期化指定子が要素数を超えて指定されています.
test001.c: 函数 `f' :
test001.c:10: エラー: `s' が不完全型の `struct S' として宣言されています.
test001.c:6: エラー: `struct S' はここで宣言されています.
test001.c:10: エラー: `s' の初期化指定子が要素数を超えて指定されています.
test001.c:10: エラー: `s' の初期化指定子が要素数を超えて指定されています.
test001.c:11: エラー: variable length array `a' が初期化されています.
test001.c:11: エラー: オブジェクトでない `a' に初期化指定子が指定されています.
test001.c:11: エラー: オブジェクトでない `a' に初期化指定子が指定されています.
test001.c:11: エラー: オブジェクトでない `a' に初期化指定子が指定されています.
