test001.c:6: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test001.c:6: エラー: `x' に対する初期化指定子が不正です. 修飾子が失われます.
test001.c:8: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test001.c:8: エラー: `y' に対する初期化指定子が不正です. 修飾子が失われます.
test001.c:10: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test001.c:10: エラー: `z' に対する初期化指定子が不正です. 修飾子が失われます.
test001.c: 函数 `f' :
test001.c:14: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test001.c:15: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test001.c:16: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test001.c:17: エラー: 代入演算子の左オペランド `2' は変更できません.
test001.c:18: エラー: 代入演算子の左オペランド `2.5' は変更できません.
test001.c:19: エラー: 代入演算子の左オペランドは変更できません.
