test001.c: 函数 `test00' :
test001.c:8: エラー: `++' 演算子がオブジェクトでない型 `void(void)' へのポインタに適用されています.
test001.c:9: エラー: `--' 演算子がオブジェクトでない型 `void(void)' へのポインタに適用されています.
test001.c: 函数 `test01' :
test001.c:14: エラー: `++' 演算子がオブジェクトでない型 `struct S' へのポインタに適用されています.
test001.c:15: エラー: `--' 演算子がオブジェクトでない型 `struct S' へのポインタに適用されています.
test001.c: 函数 `test02' :
test001.c:20: エラー: `++' 演算子がオブジェクトでない型 `union U' へのポインタに適用されています.
test001.c:21: エラー: `--' 演算子がオブジェクトでない型 `union U' へのポインタに適用されています.
test001.c: 函数 `test03' :
test001.c:26: エラー: `++' 演算子がオブジェクトでない型 `enum E' へのポインタに適用されています.
test001.c:27: エラー: `--' 演算子がオブジェクトでない型 `enum E' へのポインタに適用されています.
test001.c: 函数 `test04' :
test001.c:32: エラー: `++' 演算子がオブジェクトでない型 `int[]' へのポインタに適用されています.
test001.c:33: エラー: `--' 演算子がオブジェクトでない型 `int[]' へのポインタに適用されています.
test001.c: 函数 `test05' :
test001.c:38: エラー: `++' 演算子がオブジェクトでない型 `void' へのポインタに適用されています.
test001.c:39: エラー: `--' 演算子がオブジェクトでない型 `void' へのポインタに適用されています.
