test000.c: 函数 `test00' :
test000.c:13: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:14: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:15: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:17: エラー: 単項の `&' が register 宣言されている `a' に指定されています.
test000.c:16: エラー: `a' はここで register 宣言されています.
test000.c:18: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c:19: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c:20: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c:22: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test01' :
test000.c:28: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:30: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:32: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:33: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c:35: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c:37: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test02' :
test000.c:43: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:44: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:45: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:46: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:47: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:48: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:49: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c:50: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c:51: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test03' :
test000.c:58: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:60: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test04' :
test000.c:66: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:67: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test05' :
test000.c:73: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:74: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test06' :
test000.c:80: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:81: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test07' :
test000.c:87: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:88: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test08' :
test000.c:94: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:95: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test09' :
test000.c:101: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:102: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test10' :
test000.c:108: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:109: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test11' :
test000.c:115: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:116: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test12' :
test000.c:122: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:123: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test13' :
test000.c:129: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:130: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test14' :
test000.c:136: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:137: エラー: 単項の * がポインタでない型の式に指定されています.
test000.c: 函数 `test15' :
test000.c:143: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:144: エラー: 単項の * がポインタでない型の式に指定されています.
