test000.c: 函数 `test00' :
test000.c:12: エラー: `++' 演算子がスカラー型でない `s' に適用されています.
test000.c:14: エラー: `--' 演算子がスカラー型でない `u' に適用されています.
test000.c: 函数 `test01' :
test000.c:21: エラー: `++' 演算子がスカラー型でない `s' に適用されています.
test000.c:21: エラー: 式文の式の型が不完全型です.
test000.c:23: エラー: `--' 演算子がスカラー型でない `u' に適用されています.
test000.c:23: エラー: 式文の式の型が不完全型です.
test000.c: 函数 `test02' :
test000.c:30: エラー: `++' 演算子がスカラー型でない `e' に適用されています.
test000.c:30: エラー: 式文の式の型が不完全型です.
test000.c:31: エラー: `--' 演算子がスカラー型でない `e' に適用されています.
test000.c:31: エラー: 式文の式の型が不完全型です.
test000.c: 函数 `test03' :
test000.c:37: エラー: `++' 演算子が型 `void(void) 'に適用されています.
test000.c:38: エラー: `--' 演算子が型 `void(void) 'に適用されています.
test000.c: 函数 `test04' :
test000.c:45: エラー: `++' 演算子が型 `int[10] 'に適用されています.
test000.c:46: エラー: `--' 演算子が型 `int[10] 'に適用されています.
