test000.c: 函数 `test00' :
test000.c:6: エラー: 代入演算子の左オペランド `1.0F' は変更できません.
test000.c:7: エラー: 代入演算子の左オペランド `0xab.cdp+2' は変更できません.
test000.c:8: エラー: 代入演算子の左オペランド `5.6e+7L' は変更できません.
test000.c: 函数 `test01' :
test000.c:13: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:14: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c:15: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test000.c: 函数 `test02' :
test000.c:21: エラー: case ラベル `0XABP2F' が整数ではありません.
test000.c:23: エラー: case ラベル `.1' が整数ではありません.
test000.c:25: エラー: case ラベル `.3e-5L' が整数ではありません.
