test000.c: 函数 `test000' :
test000.c:6: エラー: 代入演算子が型 `void(void)' に適用されています.
test000.c: 函数 `test001' :
test000.c:13: エラー: 代入演算子が型 `int[10]' に適用されています.
test000.c: 函数 `test002' :
test000.c:19: エラー: 代入演算子の左オペランドは変更できません.
test000.c:22: エラー: 代入演算子の左オペランド `x' は変更できません.
test000.c: 函数 `test003' :
test000.c:30: エラー: `x' に対する代入演算子が不正です.
test000.c: 函数 `test004' :
test000.c:35: エラー: 代入演算子の左オペランド `1' は変更できません.
test000.c:36: エラー: 代入演算子の左オペランド `3.0' は変更できません.
test000.c:37: エラー: 代入演算子の左オペランド `'a'' は変更できません.
test000.c:38: エラー: 代入演算子が型 `char[12]' に適用されています.
