test002.c: 函数 `test000' :
test002.c:6: エラー: 代入演算子の左のオペランドが左辺値を持ちません.
test002.c:7: エラー: 代入演算子の左のオペランドが左辺値を持ちません.
test002.c:8: エラー: 代入演算子の左のオペランドが左辺値を持ちません.
test002.c:9: エラー: 代入演算子の左のオペランドが左辺値を持ちません.
test002.c:10: エラー: 代入演算子の左のオペランドが左辺値を持ちません.
test002.c:11: エラー: 代入演算子の左のオペランドが左辺値を持ちません.
test002.c:12: エラー: 代入演算子の左のオペランドが左辺値を持ちません.
test002.c:13: エラー: 代入演算子の左のオペランドが左辺値を持ちません.
test002.c:14: エラー: 代入演算子の左のオペランドが左辺値を持ちません.
test002.c:15: エラー: 代入演算子の左のオペランドが左辺値を持ちません.
test002.c:16: エラー: 代入演算子の左のオペランドが左辺値を持ちません.
test002.c: 函数 `test001' :
test002.c:21: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test002.c:22: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test002.c:23: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test002.c:24: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test002.c:25: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test002.c:26: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test002.c:27: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test002.c:28: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test002.c:29: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test002.c:30: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
test002.c:31: エラー: 単項の `&' 演算子が左辺値でない式に適用されています.
