test007.c:4: エラー: `xxx' は宣言されていません.
test007.c:4: エラー: `xxx' の宣言で `int' が仮定されました.
test007.c:4: エラー: `xxx' が再宣言されています.
test007.c:4: エラー: ここで宣言されていました.
test007.c:4: エラー: `int' で構文エラーです.
test007.c:4: エラー: `yyy' は宣言されていません.
test007.c:5: エラー: `xxx' の宣言で `int' が仮定されました.
test007.c:5: エラー: `xxx' が再宣言されています.
test007.c:4: エラー: ここで宣言されていました.
test007.c:5: エラー: `int' で構文エラーです.
test007.c:5: エラー: `zzz' は宣言されていません.
test007.c:7: エラー: `xxx' の宣言で `int' が仮定されました.
test007.c:7: エラー: `xxx' が再宣言されています.
test007.c:5: エラー: ここで宣言されていました.
test007.c:7: エラー: `int' で構文エラーです.
test007.c:7: エラー: `a' は宣言されていません.
